[
    {
        "name": "Android Controlled Robotics",
        "link": "androidcontrolledrobotics",
        "banner": "robotics.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "This Work shop is a fast-paced program designed to give the students the hands-on experience in Robotics using ANDROID/BLUETOOTH.This workshop is primarily targeted at students who wish to discover the new technology by hands on training session.This workshop program is designed to clear your concepts in Bluetooth communication and Microcontroller Programming.",
                "subimage": ""
            },
            {
                "subtitle": "Workshop Fees",
                "subdescription": "Rs 1600 along with a toolkit.",
                "subimage": ""
            },
            {
                "subtitle": "Duration",
                "subdescription": "2 Days(8 Hours each)",
                "subimage": ""
            },
            {
                "subtitle": "Contact Details",
                "subdescription": "Sanket Gawande - 8197772633",
                "subimage": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ]
    },
    {
        "name": "Bridge Design",
        "link": "bridgedesign",
        "banner": "bridgedesign.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "Be it the Golden Gate Bridge of San Francisco or the London Bridge, bridges have always been awe-inspiring. Their sheer magnitude, beauty and utility has made them the landmarks of many a towns and cities. They not only signify strength but also a symbol of development, connecting people all over the world. Bridge building and construction is an essential part of the civil engineering discipline. The workshop shall give the participants a hand-on experience on the topic to all the pursuing civil engineers. A lecture session will be taken by the experts on CAD based Bridge design which shall be followed by fabrication and testing of the bridge model. The lecture session shall also consist of the different types of bridges existing, structural response of bridges to different types of moving loads and load calculation in various truss using a CAD model",
                "subimage": ""
            },
            {
                "subtitle": "Workshop Fees",
                "subdescription": "Rs 1500",
                "subimage": ""
            },
            {
                "subtitle": "Duration",
                "subdescription": "2 Days",
                "subimage": ""
            },
            {
                "subtitle": "Contact Details",
                "subdescription": "Sanket Gawande - 8197772633",
                "subimage": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ]
    },
    {
        "name": "Vehicle Overhauling",
        "link": "vehicleoverhauling",
        "banner": "vehicleoverhauling.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "This program is conceptualized to impart industrial work flow to students that how automobile components function, how vehicle is conceptualized, designed and manufactured. This program provide a platform for the students which supports their engineering thoughts and give them a pragmatic experience",
                "subimage": ""
            },
            {
                "subtitle": "Workshop Fees",
                "subdescription": "Rs 1300",
                "subimage": ""
            },
            {
                "subtitle": "Duration",
                "subdescription": "2 Days",
                "subimage": ""
            },
            {
                "subtitle": "Contact Details",
                "subdescription": "Sanket Gawande - 8197772633",
                "subimage": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ]
    },
    {
        "name": "BIG DATA",
        "link": "bigdata",
        "banner": "bigdata.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "Big Data is a collection of large and complex data sets that cannot be processed using regular database management tools or processing applications. A lot of challenges such as capture, curation, storage, search, sharing, analysis, and visualization can be encountered while handling Big Data. On the other hand the Apache Hadoop software library is a framework that allows for the distributed processing of large data sets across clusters of computers using simple programming models. It is designed to scale up from single servers to thousands of machines, each offering local computation and storage. Big Data certification is one of the most recognized credentials of today.",
                "subimage": ""
            },
            {
                "subtitle": "Workshop Fees",
                "subdescription": "Rs 1500 for a student and Rs 2000 for faculty.",
                "subimage": ""
            },
            {
                "subtitle": "Duration",
                "subdescription": "2 Days(8 Hours each)",
                "subimage": ""
            },
            {
                "subtitle": "Contact Details",
                "subdescription": "Sanket Gawande - 8197772633",
                "subimage": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ]
    },
    {
        "name": "Ethical Hacking",
        "link": "ethicalhacking",
        "banner": "ethicalhacking.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "Ethical hacking is an important tool in many national security agencies and even companies. An Ethical Hacker is usually employed with the organization and can be trusted to undertake an attempt to penetrate networks and/or computer systems using the same methods as a Hacker. The goal of the ethical hacker is to help the organization take pre-emptive measures against malicious attacks by attacking the system himself; all the while staying within legal limits. In order to become an Ethical Hacker or Security Expert, one must think out of the box with the mentality that in order to catch a thief.",
                "subimage": ""
            },
            {
                "subtitle": "Workshop Fees",
                "subdescription": "Rs. 1400 and this fee includes workshop training, certification, event registration and Software Kit.",
                "subimage": ""
            },
            {
                "subtitle": "Duration",
                "subdescription": "2 Days",
                "subimage": ""
            },
            {
                "subtitle": "Contact Details",
                "subdescription": "Sanket Gawande - 8197772633",
                "subimage": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ]
    },
    {
        "name": "Internet of Things",
        "link": "internetofthings",
        "banner": "internetofthings.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "The Internet of Things is upon us! Connected Products are everywhere, and companies like the newly Google-acquired Nest are bringing the IoT into our homes. Come be a part of the next major leap forward in mankinds technical evolution - The Internet of Things! Come to this workshop equipped with your own IoT ideas and make them a reality.",
                "subimage": ""
            },
            {
                "subtitle": "Workshop Fees",
                "subdescription": "The fees will be Rs. 1350 which will include workshop training, study material and a Software Kit",
                "subimage": ""
            },
            {
                "subtitle": "Duration",
                "subdescription": "2 Days(12-14 Hours each)",
                "subimage": ""
            },
            {
                "subtitle": "Contact Details",
                "subdescription": "Sanket Gawande - 8197772633",
                "subimage": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ]
    },
    {
        "name": "Unmanned Ground Vehicle",
        "link": "unmannedgroundvehicle",
        "banner": "unmannedgroundvehicle.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "An Unmanned Ground Vehicle(UGV) is a vehicle that operates while in contact with the ground and without an on board human presence. UGV's can be used for many applications where it may be inconvenient, dangerous, or impossible to have a human operator present. Generally, the vehicle will have a set of sensors to observe the environment, and will either autonomously make decisions about its behavior or pass the information to a human operator at a different location who will control the vehicle through teleoperation. This workshop will be dealing with an autonomous bot which will be performing the basic tasks of Image Processing and Ball Tracking.",
                "subimage": ""
            },
            {
                "subtitle": "Workshop Fees",
                "subdescription": "4000 INR per team. A team can be a maximum of four members. Kits will be provided to each team. Individual kits will also be made available for sale.",
                "subimage": ""
            },
            {
                "subtitle": "Duration",
                "subdescription": "A total of 14 hours spanning over 2 days.",
                "subimage": ""
            },
            {
                "subtitle": "Contact Details",
                "subdescription": "Sanket Gawande - 8197772633",
                "subimage": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    "",
                    "",
                    "",
                    ""
                ]
            },
            {
                "title": "cont",
                "items": [
                    ""
                ]
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ]
    }
]