[{"name":"Battle of Brands","link":"battleofbrands","banner":"battleofbrandsbanner.svg","subdesc":[{"subtitle":"","subdescription":"Adidas on the feet, Nike on your ankles, Van Heusen on your legs and Jockey under, Levis on your torso and Tommy on your wrists, Ray-Ban on your eyes and Apple in your pockets. \nBrands land in your mind, head to toe, cloaked in brands are we. How good are you at them? Pilot it at the battle of brands. \nBut do you know them enough? \nIf yes, then you had the talent that we are looking for. But beware; you are not the only one with a heart full of logos. So gear up, flex those creative muscles and tickle the funny bone. We welcome you to the BATTLE OF BRANDS!","subimage":""}],"list":{"title":"","items":[""]},"subimage":[{"title":"","link":""}]},{"name":"Vipanan","link":"vipanan","banner":"vipananbanner.svg","subdesc":[{"subtitle":"","subdescription":"Do you follow & love the print ads of Zomato? Do you sing along to Internet Se Hatt jingle of McDonalds? Do you know who Piyush Pandey is? Do you remember the names of the Nirma girls? If a friend says No idea, do you reply with Get idea? Do you think you can sell anything with your skills? Or do you want to? Welcome aboard, we love marketing too! Are you creative, innovative and capable of carrying the products to the customers? \nIf so then Game is yours  People dont buy products and services, what they buy is relations, stories and magic. Unleash the creativity that lies inside you and create that Marketing Magic !!! \n Use Social Media to promote a business  Devise a strategy to launch a product  Show your power to Convince, Negotiate & Sell Win Exciting Prizes along with memories to be cherished for life","subimage":""}],"list":{"title":"","items":[""]},"subimage":[{"title":"","link":""}]},{"name":"Stockoholic","link":"stockoholic","banner":"stockoholicbanner.svg","subdesc":[{"subtitle":"","subdescription":"Virtual trading of stocks. If you think you have the prowess to tame the bulls and shirk the very pillars of the equity market, we provide you the platform to challenge, enrich and outperform yourselves and have an enchanting experience that will mesmerize your journey to a whole new world of Finance. This event will give you a learning experience to make your wealth grow virtually,... Get, set and go to act as a smart investor! \nExciting cash prizes to be won!","subimage":""}],"list":{"title":"","items":[""]},"subimage":[{"title":"","link":""}]},{"name":"coHRence","link":"cohrence","banner":"cohrencebanner.svg","subdesc":[{"subtitle":"","subdescription":"coHRence \nTime and again we have pushed our artificial intelligence to help organizations identify and screen the right applicant for the right position effectively. But the truth is that, the heart of hiring, training and retaining is a human one, and no amount of technology will permanently displace those involved in HR. Without a talented HR department equipped with people skStokholicills to hire and motivate work groups, the organization is doomed for failure. \ncoHRence is a creation of activity that has an entertaining, instructive and competing element to it. The event explores participants skills to discover a great peoples leader who creates a culture of innovation in addition to do justice to the traditional HR functions of talent acquisition, development and team management - all of which steer an organizations growth.","subimage":""}],"list":{"title":"","items":[""]},"subimage":[{"title":"","link":""}]}]