[
    {
        "name": "Battle of Brands",
        "link": "battleofbrands",
        "banner": "battleofbrandsbanner.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "Brands have become an integral part of our daily lives. From the moment you pick up the tooth brush in the morning we are surrounded by the brands we love.<br>\nBut how really aware are we about these brands? <br>\nBattle of Brands (BoB) is a fun and entertaining event where creativity and thinking out of the box helps you get closer to the prize money.",
                "subimage": ""
            },
            {
                "subtitle": "ROUNDS",
                "subdescription": "The whole event is divided into five parts:-<br>\n<ol>\n<li><b>BRAND MASTER</b><br>\n<p>A collection of different brand logos will be flashed for 30sec. \nAfter that 1min will be given to write down the names of the brands. The participants who could the maximum names move forward.</p></li>\n<li><b>CORPORATE PICASSO</b><br>\n<p>The participants have to completely redesign the logo of a famous brand. They have to give a brief description of the changes that have been made, the reason for the changes and the hidden meanings in the redesigned logo, if any.</p></li>\n<li><b>SCREW-BRANDS</b><br>\n<p>The products of famous brands will be switched to completely irrelevant products and the participants have to promote the product under that brand name</p></li>\n<li><b>LOONEYTAG </b><br>\n<p>A new and funny tagline will be presented. The tagline will be common to all the participants. Different products will be written on pieces of paper and the candidates have to select a product by picking one from a hat.</p></li>\nThe participants should then come up with a 20sec commercial with the tagline.\n<li><b>DESPICABLE DEALER</b><br>\n<p>The final participants are given comparable products. They have to sell their products and the winner will be the participant with the maximum votes. But there is a catch. The participants can’t say anything about their own product. All they have to do is degrade the opponent’s product.</p></li>\n</ol>",
                "subimage": ""
            },
            {
                "subtitle": "RULES",
                "subdescription": "<ul>\n<li>This is a team event with each team consisting of 2-3 members. </li>\n<li>Members of the team can be students from different institutes.</li>\n<li>An individual cannot be part of more than one team.</li>\n</ul>",
                "subimage": ""
            },
            {
                "subtitle": "Prizes",
                "subdescription": "Prizes worth INR 17,500 are at stake!",
                "subimage": ""
            },
            {
                "subtitle": "Contacts",
                "subdescription": "<li>Kesar Jha <br>kesarjha@gmail.com<br>+918904344063</li>\n<li>Neha Brohma <br>nehabrohma@gmail.com<br> +919611341304</li>\n<li>Ganesh Gopakumar<br>ganeshg818@gmail.com <br> +919633311702</li>\n</ul>",
                "subimage": ""
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ]
    },
    {
        "name": "Vipanan",
        "link": "vipanan",
        "banner": "vipananbanner.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "<i><b>“Marketing and innovation produce results; all the rest are costs. Marketing is the distinguishing, unique function of the business.\"</b></i> – Peter Drucker<br>\n<p>Vipanan is an event which tests the marketing mettle of the participants by pulling out their presentation, pitching, convincing, negotiating skills. Each round of the event has been designed in a way that it challenges the marketer in the participants and makes them pull out the best rabbits out of their hats. But don’t worry, just keep in mind <i>‘Impossible is nothing’</i>.<p>",
                "subimage": ""
            },
            {
                "subtitle": "ROUNDS",
                "subdescription": "<ul>\n<li>\n<b>ROUND 1- Preliminary Screening</b><br>\n<ul>\n<li>Preliminary Screening round will be conducted online using the platform of Dare2Compete. The screening round will be conducted in association with a StartUp (Preferably from NITK).</li>\n<li>Registrations of the round will be carried out online using Google Docs & registrations will happen in teams of two.</li>\n<li>In the screening round teams will have to do two things:<ul>\n<li>The screening round will be conducted in association with a StartUp and they will have to develop promotional strategy for the StartUp.</li>\n<li>Teams will be supplied one poster promoting the startup. They will have to make the poster viral. Participants will be judged on the basis of the number of likes and shares they can garner. Participants will be selected on the basis of the cumulative scores they get in both these rounds.</li></ul>\n</li> </ul>\n</li>\n<li>\n<b>ROUND 2- Mulya Prastav</b><br>\n<ul>\n<li>Mulya Prastav is the fisrt round of the main event Vipanan and this round will be conducted in NITK.</li>\n<li>This round is about value proposition and in this round all the teams will be given a product and each team will be given a scenario. With respect to that scenario they will have to come up with a value proposition. Teams will be pitching their proposition before a panel of judges.</li>\n<li>The event will be judged by a panel of Judges and their decision will be final and will not be subject to any contest. Other regulations regarding the round will be explained on the spot.</li>\n</ul></li>\n<li>\n<b>ROUND 3 - Launch !!!</b><br>\n<ul>\n<li>Launch is a traditional business round and deals with the launch of a product. The participating teams will be supplied a set of ‘Raw Product’ and for this product they will have to come up with a comprehensive marketing strategy following a given set of parameters.</li>\n<li>The specific parameters which they will have to fulfill through their marketing plan will be given on-spot and the participants will be given a presentation so as to make them aware about the parameters (Marketing jargons are sometimes confusing).</li>\n<li>The event will be judged by a panel of Judges and their decision will be final and will not be subject to any contest. Other regulations regarding the round will be explained on the spot.</li></ul></li>\n<li>\n<b>ROUND 4- Vikray</b><br>\n<ul>\n<li>Vikray is the flagship round of Vipanan and the event in every possible way tests the salesman in you.</li>\n<li>Participating groups will be given a set of products and with these products, they will have to jump into the field (don’t worry its NITK Campus only) and will have to sell their products to interested customers and earn big bucks.</li>\n<li>The Group with the most ‘Moolah’ at the end of the round will take the game. Simple!!!</li></ul>\n</li></ul>",
                "subimage": ""
            },
            {
                "subtitle": "CONTACTS",
                "subdescription": "<ul>\n<li>Shantanu Ghosal <br>san.ad27@gmail.com<br> 9964296913</li>\n<li>Shailesh Kumar <br>k.shailesh0@gmail.com<br> 8904344238</li>\n</ul>",
                "subimage": ""
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ]
    },
    {
        "name": "Stockoholic",
        "link": "stockoholic",
        "banner": "stockoholicbanner.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "Virtual trading of stocks, If you think you have the prowess to tame the bulls and shirk the ‘very’ pillars of the equity market, we provide you the platform to challenge, enrich and outperform yourselves and have an enchanting experience that will mesmerize your journey to a whole new world of Finance. This event will give you a learning experience to make your wealth grow virtually... Get, set and go to act as a smart investor!\nThe event will be conducted in 3 round formats.",
                "subimage": ""
            },
            {
                "subtitle": "ROUNDS",
                "subdescription": "<ul>\n<li><b>FIRST ROUND</b><br>\n<p>This round will be online round where participants have to play on the specified platform provided by us. Trading window of 7-10 days will be provided. Based on the portfolio values top 20 will be selected.</p></li>\n<li><b>TRADING ROUND (venue: NITK Surathkal)</b><br>\n<p>Limited virtual cash will be provided to the selected participants for trading in a 3 hours trading window. Participants have to trade from the given sectors: Bank, Auto, IT, FMCG, Pharma.\nCriteria: Participants have to trade (buy and sell) stocks from the above mentioned sectors (Information regarding number of stocks to be traded will be provided at the time of round). </p></li>\n<li><b>SURPRISE ROUND (Venue: NITK Surathkal)</b><br>\n<p>Event details will be disclosed at the time of event</p></li>\n</ul>",
                "subimage": ""
            },
            {
                "subtitle": "CONTACTS",
                "subdescription": "<ul>\n<li>Abhisek Ray<br>abhisek.ray10@gmail.com<br>\n7022090095</li>\n<li>Diptesh Bhowmick<br>deep07230@gmail.com<br>\n9964302084</li>\n<li>Sarath M<br>sarathmkolathur@gmail.com<br>8086150409</li>\n</ul>",
                "subimage": ""
            },
            {
                "subtitle": "Registration",
                "subdescription": "<ul>\n<li> For Registration go to : <a href='http://www.dsij.in/stock-market-challenge.aspx'>http://www.dsij.in/stock-market-challenge.aspx</a></li>\n<li> Go to settings tab and join the contest named <STOCKOHOLIC>. Enter the key <b> BuCf0RbE</b> </li>\n</ul>",
                "subimage": ""
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ]
    },
    {
        "name": "Cohrence",
        "link": "cohrence",
        "banner": "cohrencebanner.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "<p>Time and again we have pushed our artificial intelligence to help organizations identify and screen the right applicant for the right position effectively. But the truth is that, the heart of hiring, training and retaining is a human one, and no amount of technology will permanently displace those involved in HR. Without a talented HR department equipped with people skills to hire and motivate work groups the organization is bound to fail.</p>\n<p><b>CoHRence</b> is a creation of activity that has an entertaining, instructive and competing element to it. The event explores participant’s skills to discover a great people’s leader who creates a culture of innovation in addition to do justice to the traditional HR functions of talent acquisition, development and team management all of which steer an organization’s growth.</p>",
                "subimage": ""
            },
            {
                "subtitle": "ROUNDS",
                "subdescription": "<ul>\n<li><b>ROUND 1- JAM</b><br> \n<p>This round is divided into 2 parts. </p>\n<ul>\n<li>The first part of this round is an MCQ which is focused only on HR related topics. Here the knowledge of the contestants is tested.</li>\n<li>This is followed by JAM which is all about speaking the most in a minute. Here the participant will be asked to randomly pick notes from the bowl that will contain the topics on which the participants are required to talk on. Just like the previous contest, the topic here is concerned with human resources concept (leadership, perception, personality etc.). No participant will be made to talk on the same subject. The contestant will be speaking with accordance to the buzzer and he will be cautioned with a warning buzzer on the completion of 45 seconds. Half the participants will be selected (Max-20, Min-10) but in an even number due to a necessity in the second round.</li></ul>\n</li>\n\n<li><b>ROUND 2- HRecruitment</b><br>\n<p>This round also includes two events. The first one is about creating an innovative resume and the second on recruitment.</p>\n<ul>\n<li>Each participant is required to make a resume on the spot and will be provided a maximum of 15 minutes. Contestants will be evaluated on the basis of their creativity and also presentation.</li>\n<li>The second part in this round is about selecting and getting selected. Each candidate will be randomly selected and paired with other participant, to get as well as take an interview. Evaluation sheets will be provided to the participants with a set of predefined parameters, which will be submitted to the volunteers present during the interview. Finally, 4-5 people will be selected for the last round.</li></ul>\n</li>\n\n<li><b>ROUND 3- HRanbhoomi</b><br>\n<p>In this round, a live case study will be presented before the contestants. This is followed by questioning by the judges. These case studies will be provided by a company and will be the same for all the contestants.<p></li>\n</ul>",
                "subimage": ""
            },
            {
                "subtitle": "PRIZES",
                "subdescription": "<ul>\n<li>1ST PRIZE- 10000/-</li>\n<li>2ND PRIZE-7500/-</li></ul>",
                "subimage": ""
            },
            {
                "subtitle": "CONTACTS",
                "subdescription": "<ul>\n<li>Singh Tarini Priya<br>+91-8792879608<br>singhtarinipriya25annie@gmail.com<br></li>\n<li>Apoorva Dhriti<br>+91-9481854805 <br>apoorva.dhriti@gmail.com</li>\n</li></ul>",
                "subimage": ""
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ]
    }
]