[{"name":"Breakdown","link":"breakdown","banner":"breakdownbanner.svg","subdesc":[{"subtitle":"","subdescription":"A full day event comprising of two major rounds- Round 1: Elimination Round- A test comprising of chemistry, mathematics, physics questions and puzzles. Teams of two can participate and ten teams move on to the second round. Round 2: Practical Round- Based on a storyline, ten teams will be put on quest to find the solution. The round will be split into sub rounds where teams will be judged on their accuracy and pace. Calculations, experimentations and arriving at a solution with respect to the storyline- Last years theme was the churning of ocean and the search for elixir was the solution. Calculations involving population density in sea, BOD and experimentation involving titrations to find the final solution.","subimage":""}],"list":{"title":"","items":[""]},"subimage":[{"title":"","link":""}]},{"name":"Contraption","link":"contraption","banner":"contraptionbanner.svg","subdesc":[{"subtitle":"","subdescription":"Problem statement will be provided and based on that a model needs to be constructed that must satisfy the problem specification. Teams of two or three participate and build a model. Last years event involved a construction of a Vortex scanner which must shoot down a castle of paper cups using smoke.","subimage":""}],"list":{"title":"Team Members","items":["2 to 3"]},"subimage":[{"title":"","link":""}]},{"name":"Industry Defined Problem","link":"industrydefinedproblem","banner":"industrydefinedproblembanner.svg","subdesc":[{"subtitle":"","subdescription":"An industry provides a problem statement, which they might be facing or have faced. Groups of two or three participate and present their solution in front of industry personnel. This is a sponsored event, where the industry providing the problem gives the prize money. The company benefits as they get the solution for the problem.","subimage":""}],"list":{"title":"","items":[""]},"subimage":[{"title":"","link":""}]},{"name":"Catalysis - Workshop","link":"catalysisworkshop","banner":"catalysisworkshopbanner.svg","subdesc":[{"subtitle":"","subdescription":"A two day Technology Orientation Workshop on Industry Perspective on Chemical Process Design, Operations and Control conducted by Institute of Process and Control Engineers (IPCE).","subimage":""}],"list":{"title":"","items":[""]},"subimage":[{"title":"","link":""}]},{"name":"Online Quiz","link":"onlinequiz","banner":"onlinequizbanner.svg","subdesc":[{"subtitle":"","subdescription":"This takes place before Engineer. Questions are posted in Facebook on the Engineer page everyday for a week. Winners are chosen according to accuracy with which they answer.","subimage":""}],"list":{"title":"","items":[""]},"subimage":[{"title":"","link":""}]} ]