[
    {
        "name": "Breakdown",
        "link": "breakdown",
        "banner": "breakdownbanner.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "<b><i>\"Sugar, spice and everything nice\n<br>These were the ingredients chosen\n<br>To create the perfect little girls\n<br>But Professor Utonium accidentally\n<br>Added an extra ingredient to the concoction Chemical X\n<br>Thus the Powerpuff girls were born \n<br>Using their ultra-super powers\n<br>Blossom, Bubbles and Buttercup\n<br>Have dedicated their lives to fighting crime\n<br>And the forces of evil\"</i></b> &nbsp; - \"Powerpuff Girls\"\n<br><br>\n<p>If you think you’ve got what it takes to analyze mysterious concoctions and discover the Chemical X, then Breakdown is where you ought to be. We take you on a journey by brushing your skills in basic</p><p>Forensics, Archaeology, Extra-terrestrial life, Zombies; the previous editions have explored it all. Engineer 2014 promises a yet another nerve crackling theme. Get through the intricacies of our prelims and we'll let you have fun with the potions! sciences (Spoiler: Chemistry) and tickling your brain cells to introducing you to a whole new perspective of ‘The science of matter’.</p>",
                "subimage": ""
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ],
        "list": [
            {
                "title": "Rules and Regulations",
                "items": [
                    "A team can have a maximum of 2 people.",
                    "Both members of the team are to be enrolled as students in an educational institute.",
                    "No person can be a part of more than 1 team.",
                    "There is no restriction on the number of people participating from a particular institute."
                ]
            },
            {
                "title": "Rounds",
                "items": [
                    "First round will comprise of a Written Quiz testing concepts of Chemistry (+2 Level) and General Science.",
                    "Selected teams will get to solve the hands on puzzle, working in the Chemistry Laboratory.",
                    "This being a spot event, the problem statement will be released on the event day itself."
                ]
            }
        ]
    },
    {
        "name": "Contraption",
        "link": "contraption",
        "banner": "contraptionbanner.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "Problem statement will be provided and based on that a model needs to be constructed that must satisfy the problem specification. Teams of two or three participate and build a model. Last year’s event involved a construction of a Vortex scanner which must shoot down a castle of paper cups using smoke.",
                "subimage": ""
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ]
    },
    {
        "name": "Industry Defined Problem",
        "link": "industrydefinedproblem",
        "banner": "industrydefinedproblembanner.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "An industry provides a problem statement, which they might be facing or have faced. Groups of two or three participate and present their solution in front of industry personnel. This is a sponsored event, where the industry providing the problem gives the prize money. The company benefits as they get the solution for the problem.",
                "subimage": ""
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ]
    },
    {
        "name": "Catalysis - Workshop",
        "link": "catalysisworkshop",
        "banner": "catalysisworkshopbanner.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "A two day Technology Orientation Workshop on Industry Perspective on Chemical Process Design, Operations and Control conducted by Institute of Process and Control Engineers (IPCE).",
                "subimage": ""
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ]
    },
    {
        "name": "Online Quiz",
        "link": "onlinequiz",
        "banner": "onlinequizbanner.jpg",
        "subdesc": [
            {
                "subtitle": "Overview",
                "subdescription": "Get ready for some intense quizzing- Chemical events, Engineer 2014 brings you yet another edition of the online quiz!!\n<br><br>Covering all domains of Chemistry and Chemical Engineering, from the history of discoveries and inventions to the magic of reactions and the arena of industries, the quiz runs for 7 days starting from 1th of October 2014, with a question per day. The top three fastest correct answers on each day will be awarded 25, 15 and 10 points respectively. The cumulative leaders at the end of the 7 day period will be declared winners.\n<br><br>Stay tuned to the pages mentioned below to get to know what more is in store for this edition of the online quiz.\n<br><br><a href='https://www.facebook.com/EngineerNITK'>https://www.facebook.com/EngineerNITK</a>\n<br><a href='https://www.facebook.com/ChemicalEventsEngineer'>https://www.facebook.com/ChemicalEventsEngineer</a>",
                "subimage": ""
            }
        ],
        "subimage": [
            {
                "title": "",
                "link": ""
            }
        ],
        "list": [
            {
                "title": "",
                "items": [
                    ""
                ]
            }
        ]
    }
]