[{"name":"Colossus","link":"colossus","banner":"colossusbanner.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Cargo Bridge is just a game. In colossus, you are required to build structures like bridges and trusses by designing them, and making a real model. Take the challenge of building these structures, to test your knowledge in structural engineering.","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Nirvahana","link":"nirvahana","banner":"nirvahanabanner.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Have a concern for the nature and responsibility towards the society? Nirvahana is the right platform for you. This event requires participants to come up with simple, yet creative solutions to address problems and tackle them in an innovative way!","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Mind Bend","link":"mindbend","banner":"mindbendbanner.jpg","subdesc":[{"subtitle":"Overview","subdescription":"With a combination of mind boggling questions, core concepts and some really exciting rounds, mind bend is definitely a test of your intellect! Time to prove yourself!","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Architect","link":"architect","banner":"architectbanner.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Architect is a unique event where participants are required to utilize creativeness to create simple but working structure out of items of daily requirements, in the field of civil engineering that can be tested to work out in given conditions. Let us put your technical skills to the test!","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Civil Blueprint","link":"civilblueprint","banner":"civilblueprintbanner.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Interested in research about general civil engineering related problems? Civil blueprint is the right choice for you! With your basic concepts of mechanics you’ll be required implement new ideas and present them.","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]}]