[{"name":"Marathon","link":"marathon","banner":"marathon.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Marathon is an event that inculcates multiple tasks of varying difficulty covering all fields of computer science. The event tests how long one can persist solving the trickiest (and often the simplest) computer science problems thrown at them\n\nThe first round is usually a pencil and paper round where everyone is given a set of difficult questions of mathematical or logical nature and they are expected to solve them within a given time frame (usually an hour). The questions have a story around it and is fun to both read and solve those questions. The top few teams move on to the next round","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Rectify","link":"rectify","banner":"rectify.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Marathon is an event that inculcates multiple tasks of varying difficulty covering all fields of computer science. The event tests how long one can persist solving the trickiest (and often the simplest) computer science problems thrown at them\n\nRectify is an individual event which tests not only the mastery and familiarity with a programming language but also the contestants dexterity in analysing problems and providing logical solutions\n\nThe first round is a pencil and paper round where the participants are given a set of small snippets of source code and the expected output. They have to correct the mistakes / or point it out to solve the question.\nFinal Round is a coding round which tests your out of the box thinking.","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Inscription","link":"inscription","banner":"inscription.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Inscription is the international online programming contest of ENGINEER. It is an individual online event. It provides participants an exciting and stimulating opportunity to improve one's algorithmic and coding skills. It involves interpreting and reducing the problem statement correctly and then design on efficient algorithms to solve it. Contestants have to write working code in language of their choice as fast as possible.\n\nIn 2014 edition, the duration of the contest was 12 hours and 1000+ participants from as many as 30 countries were a part of this grand contest. The event witnessed some of India’s best competitive programmers (including ACM ICPC World Finalists). The participant who has solved the most number of questions in the least amount of time wins the event.","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Kode Kombat","link":"kodekombat","banner":"kodekombat.jpg","subdesc":[{"subtitle":"Overview","subdescription":"A team event where you will code and have a lot of fun doing it. Its a mix of all the things you love about computer science. There will be three rounds and each round will be a thrilling mix of coding , debugging and puzzles on the rocks. All teams will be engaged in continuous battles collecting points on there way. We will test not just your programming skills but also how much creativity and how much out of the box thinking you can pull off. This event is a treat to all the geeks out there, Kode Kombat will serve you Bugs.","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Code Rush","link":"coderush","banner":"coderush.jpg","subdesc":[{"subtitle":"Overview","subdescription":"We invite a speaker who is fairly reputed in the field of computer science (industry or educational field).The speaker last year was the head of the hugely popular online platform CodeChef, Anup Kalbalia part of Directi.","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"SynthEssence","link":"synthessence","banner":"synthessence.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Synthessence comes with a unique twist to conventional CodeCombat, primarily focusing on Big Data Analytics. This event organized by DataPhi Labs(formerly Touchpoints Solutions India Pvt Ltd), provides an opportunity for the participants to get their hands dirty on Real Datasets. Teams are challenged starting from proposing the use case to implementing and presenting it. This event instills the data scientist in each participant.","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"ECTF Teaser","link":"ectfteaser","banner":"ectfteaserbanner.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Get your 1337 caps on, because it's time to hack! We bring to you the ECTF Teaser, with problems in cryptography, reverse engineering and general pwning. The Capture the Flag event will last for 16 hours. Teams of any size can participate. This contest is geared towards giving you the exposure you need to go in full-throttle during ECTF. You can usually find an admin or two idling on #ectf, on the Freenode IRC network. To get an idea about the contest checkout some good CTF archives of last year.\nhttps://github.com/ctfs/write-ups-2014\n\nRegistrations will open a week before the contest on ectf.in\nMay the best team win!","subimage":""}],"list":[{"title":"","items":[""]}],"subimage":[{"title":"","link":""}]}]