[{"name":"Counter Strike 1.6","link":"cs","banner":"csbanner.jpg","subdesc":[{"subtitle":"overview","subdescription":"The bomb has been planted\". Such sweet words that bring joy and excitement. If you understand what I'm talking about and have friends that feel the same way, form up a team and battle like-minded individuals in the paradise that is CounterStrike","subimage":""},{"subtitle":"Time and Venue","subdescription":"<b>Date</b> : 08 -11 Oct 2015<br><b>Venue</b> : CCC / SACA","subimage":""},{"subtitle":"Format","subdescription":"<ol>\n<li>First round will be done in group stages. Each group will contain three teams that will compete in round-robin format.</li>\n<li>The first round will be followed by a knockout round in which the 1st team in a group competes with the 2nd team in another group (subsequent group).</li>\n<li>Rest of the tournament till finals will be knockout. (single elimination)</li>\n</ol>","subimage":""},{"subtitle":"Rules","subdescription":"<ol>\n<li>First round will be a knife round between one player from each team. Winner decides the map/side.</li>\n<li>Group stages will be best of 10 games. Each team plays 5 rounds a side.</li>\n<li>Knockout stages will be best of 16 games. Finals will be best of 30.</li></ol>","subimage":""},{"subtitle":"Prize","subdescription":"<small> * cash prize to be put up soon </small>","subimage":""}],"list":[{"title":"Contact Details","items":["Vinay Raj - 8904028509"]}],"subimage":[{"title":"","link":""}]},{"name":"FIFA","link":"fifa","banner":"fifabanner.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Hello and welcome to Engineer. This is Alan Smith and with me is Martin Taylor. We’ll be your \n\ncommentators for today as hosts of this mega event. Amateur footballers from all colleges set to face off and score a single goal more than their rivals. Loads of prizes to be won in this gaming event as you take your favorite team all the way towards glory in this virtual World Cup.","subimage":""},{"subtitle":"Format","subdescription":"<ol>\n <li>Version to be used is FIFA 15 </li>\n\t<li>Games will be 1v1 with random draws for the matchups</li>\n\t<li>All matches will be knockout rounds</li>\n </ol>","subimage":""},{"subtitle":"Date and Venue","subdescription":"Date</b> : 08 - 11 october 2015<br><b>Venue</b> : CCC / SACA","subimage":""},{"subtitle":"Prizes","subdescription":"<small> * cash prize to be put up soon </small>","subimage":""}],"list":[{"title":"Contact Details","items":["Karan Sahu - 9845452132"]}],"subimage":[{"title":"","link":""}]},{"name":"NFS","link":"nfs","banner":"nfsbanner.jpg","subdesc":[{"subtitle":"Overview","subdescription":"How often we have dreamed about driving the perfect car, be it a Porsche, or the new Lamborghini, or an Aston Martin or a Mercedes. Here we present you an opportunity to do so; not just drive, but race with an opponent, in a professional circuit to prove who is the better handler. \nP.S. All claims made above are to be satisfied in the virtual world only.","subimage":""},{"subtitle":"Format","subdescription":"<ol>\n <li>Version to be used is Most Wanted (2005)</li>\n\n\t <li>First round will consist of one race with up to four competitors and the bottom two performers will move to the loser bracket and the top two to the winner bracket.</li>\n\t <li>Subsequent rounds in the winner bracket will consist of 1v1 races till we get the winner bracket finalist.</li>\n\t <li>Loser bracket races will be played with 4 participants.</li>\n\t <li>Finals will be a 3 race face off with the finalists of both the brackets.</li>\n\t</ol>","subimage":""},{"subtitle":"Date and Venue","subdescription":"<b>Date</b> : 08 - 11 October 2015<br><b>Venue</b> : CCC / SACA","subimage":""},{"subtitle":"Prizes","subdescription":"<small> * cash prize to be put up soon </small>","subimage":""}],"list":[{"title":"Contact Details","items":["Karan Sahu - 9845452132"]}],"subimage":[{"title":"","link":""}]},{"name":"Dota 2","link":"dota2","banner":"dotabanner.jpg","subdesc":[{"subtitle":"Overview","subdescription":"In this perfect blend of fantasy and gaming, you can forget all about boring humanity and fight in the defense of the Ancients where \"survival of the fittest\" is the only creed to live by. Farm, gank, support, strategize, unite and attack; all the while searching for the ever-elusive RAMPAGE.","subimage":""},{"subtitle":"Format","subdescription":"<ol>\n<li>First round will be done in group stages. Each group will contain three teams that will compete in round-robin format.</li>\n<li>The team placed on top of a group will then proceed to a “winners” bracket where they will compete in knockout format till a finalist is decided.</li> \n<li>The team placed second in each group will proceed to a “losers” bracket competing in knockout format. </li>\n<li>Losing teams in losers bracket will be eliminated and losing teams in winners bracket will fall to the losers bracket. (Double elimination tournament)</li>\n<li>Final round will be between finalists of both the brackets and will be a best of 3. All other matches, best of 1.</li>\n<li>All matches in the group stages will be played in all pick mode (AP) and drafting of teams will be done 30 minutes before each game is played on two separate computers in captain’s mode (CM) to save time.</li>\n<li>All other matches will be played in CM.</li>\n</ol>","subimage":""},{"subtitle":"Date and Venue","subdescription":"<b>Date</b> : 08 -11 Oct 2015<br><b>Venue</b> : CCC / SACA","subimage":""},{"subtitle":"Prizes","subdescription":"<small> * cash prize to be put up soon </small>","subimage":""}],"list":[{"title":"Contact Details","items":["Karthik - 8197755295"]}],"subimage":[{"title":"","link":""}]}]