[{"name":"Symphony","link":"symphony","banner":"symphonybanner.jpg","subdesc":[{"subtitle":"Overview","subdescription":"we have a water fountain which is fit with waterproof lamps. The aim of the participants is to make an electronic system to sync the fountain nozzles and lights with the music being played. Get in your audio processing techniques to mesmerize the crowd by designing a choreographically complex water feature. Let the water and light dance to our tunes.<br><small><b>CLICK BELOW TO LISTEN TO THE AUDIO</b></small><br><a href=\"https://clyp.it/vjpmfvft\" target=\"_blank\"><i class=\"fa fa-volume-up\"></i></a><br>","subimage":""},{"subtitle":"Problem Statement","subdescription":"https://drive.google.com/file/d/0B2ROzCoXkeL7Qzh1Nnh0TGR1REpuNEo2OGRqaWlyWHFieE53/view?usp=sharing","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Foxhunt","link":"foxhunt","banner":"foxhuntbanner.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Foxhunt is a communication engineering based event where the participants have to find the ‘fox’ who is hiding somewhere within the campus and is transmitting codes at radio frequency. The event gives an insight into how wireless communication systems work and the complexity of antenna design. \nThe event requires the participants to build a directional antenna to receive the messages. The received signals are decoded by modifying an FM receiver to match the transmitting frequency. The direction of reception can be determined by adjusting the antenna and the position of the transmitter can be deciphered by triangulation. The goal is to find the fox at the earliest along with decoding the message being transmitted. \nA workshop will be conducted on the day of the event to help the participants build the antenna and modify the receiver.","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Trade Off","link":"tradeoff","banner":"tradeoff.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Trade-off is a fun-filled fiercely competitive circuit design competition that makes students come up with efficient, out of the box solutions to engineering problems through circuitry. The event is a race against time where utilities have to be implemented at minimum cost of components in the given time frame to fetch better points.\nThe event has 2 rounds: a preliminary written round that tests basic analog and digital circuit design skills. The shortlisted teams participate in a final practical round where circuits are to be rigged up.","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Simplicity","link":"simplicity","banner":"simplicity.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Simplicity is a signal processing based coding contest. The event is conducted over a day and the winner is declared as the team with the highest score. Participants can choose a language of their choice to code, if the output is in the format specified. The domains covered in the contest include signal processing and some basic coding questions (simple logic followed by computation).","subimage":""},{"subtitle":"Registration","subdescription":"The registration for this event is on hackerrank.<br><br>\n<a href=\"http://www.hackerrank.com/simplicity-2015\" target=\"_blank\"><button class =\"btn btn-primary\">Click to register</button></a>","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Trailblazer","link":"trailblazer","banner":"trailblazer.jpg","subdesc":[{"subtitle":"Overview","subdescription":"A trailblazer might mean a person making a new path through wilderness, but we at Tronix Committee seek more than that. The coordination of logic, sensors and actuators to navigate the path within the shortest duration wins this seemingly simple, yet challenging competition.\nThe competition is aimed at getting students in their freshman year interested in robotics. With its principle being simple, this is every electronic hobbyist’s first robot. The contest will include a line following task on a contrasting background with an additional simple task such as counting lines/blocks/other patterns.","subimage":""},{"subtitle":"Problem Statement","subdescription":"https://drive.google.com/file/d/0B8xmzLKARDdYVFJjODIxTXV4SmM/view?usp=sharing","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Automata","link":"automata","banner":"automata.jpg","subdesc":[{"subtitle":"Overview","subdescription":"Automata, the flagship event from electrical and electronics committee, Engineer 2015, invents itself every year to gratify the image processing hungry. A robot is to automate through an arena abiding by a problem statement with directions and control deduced from images sourced from an overhead camera.","subimage":""},{"subtitle":"Problem Statement","subdescription":"https://drive.google.com/file/d/0B8xmzLKARDdYR1dyMFFNeFhSSVE/view?usp=sharing","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]},{"name":"Waltz","link":"waltz","banner":"waltz.jpg","subdesc":[{"subtitle":"Overview","subdescription":"It is the one of a kind event where the robot follows the wall according the problem statement and solves the maze given by the committee.","subimage":""},{"subtitle":"Problem Statement","subdescription":"https://drive.google.com/file/d/0B8xmzLKARDdYVFpqOW5xQzRHcjA/view?usp=sharing","subimage":""}],"subimage":[{"title":"","link":""}],"list":[{"title":"","items":[""]}]}]
